package extension;

/**
 * ClassName:PerfectNumber
 * Package: extension
 * Description:
 *
 * @Author Neko
 * @Create 4/8/20238:51 pm
 * @Version 1.0
 */
public class PerfectNumber {
    public static void main(String[] args) {
        //如果一个数恰好等于它的真因子之和，则称该数为“完全数” [2] 。各个小于它的约数（真约数，列出某数的约数，去掉该数本身，剩下的就是它的真约数）的和等于它本身的自然数叫做完全数（Perfect number），又称完美数或完备数。
        //例如：第一个完全数是6，它有约数1、2、3、6，除去它本身6外，其余3个数相加，1+2+3=6。第二个完全数是28，它有约数1、2、4、7、14、28，除去它本身28外，其余5个数相加，1+2+4+7+14=28。第三个完全数是496，有约数1、2、4、8、16、31、62、124、248、496，除去其本身496外，其余9个数相加，1+2+4+8+16+31+62+124+248=496。后面的完全数还有8128、33550336等等。
        /*
        怎么做？
        出去本身之外的约数和等于该数本身


        */



    }
}
